Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz2064daa169.h
#define _ADEVCFG2_w_POSITION                     0x00000000
#define _ADEVCFG2_w_MASK                         0xFFFFFFFF
#define _ADEVCFG2_w_LENGTH                       0x00000020

#define _ADEVCFG1_FNOSC_POSITION                 0x00000000
#define _ADEVCFG1_FNOSC_MASK                     0x00000007
#define _ADEVCFG1_FNOSC_LENGTH                   0x00000003

#define _ADEVCFG1_DMTINTV_POSITION               0x00000003
#define _ADEVCFG1_DMTINTV_MASK                   0x00000038
#define _ADEVCFG1_DMTINTV_LENGTH                 0x00000003

#define _ADEVCFG1_FSOSCEN_POSITION               0x00000006
#define _ADEVCFG1_FSOSCEN_MASK                   0x00000040
#define _ADEVCFG1_FSOSCEN_LENGTH                 0x00000001

#define _ADEVCFG1_IESO_POSITION                  0x00000007
#define _ADEVCFG1_IESO_MASK                      0x00000080
#define _ADEVCFG1_IESO_LENGTH                    0x00000001

#define _ADEVCFG1_POSCMOD_POSITION               0x00000008
#define _ADEVCFG1_POSCMOD_MASK                   0x00000300
#define _ADEVCFG1_POSCMOD_LENGTH                 0x00000002

#define _ADEVCFG1_OSCIOFNC_POSITION              0x0000000A
#define _ADEVCFG1_OSCIOFNC_MASK                  0x00000400
#define _ADEVCFG1_OSCIOFNC_LENGTH                0x00000001

#define _ADEVCFG1_FCKSM_POSITION                 0x0000000E
#define _ADEVCFG1_FCKSM_MASK                     0x0000C000
#define _ADEVCFG1_FCKSM_LENGTH                   0x00000002

#define _ADEVCFG1_WDTPS_POSITION                 0x00000010
#define _ADEVCFG1_WDTPS_MASK                     0x001F0000
#define _ADEVCFG1_WDTPS_LENGTH                   0x00000005

#define _ADEVCFG1_WDTSPGM_POSITION               0x00000015
#define _ADEVCFG1_WDTSPGM_MASK                   0x00200000
#define _ADEVCFG1_WDTSPGM_LENGTH                 0x00000001

#define _ADEVCFG1_WINDIS_POSITION                0x00000016
#define _ADEVCFG1_WINDIS_MASK                    0x00400000
#define _ADEVCFG1_WINDIS_LENGTH                  0x00000001

#define _ADEVCFG1_FWDTEN_POSITION                0x00000017
#define _ADEVCFG1_FWDTEN_MASK                    0x00800000
#define _ADEVCFG1_FWDTEN_LENGTH                  0x00000001

#define _ADEVCFG1_FWDTWINSZ_POSITION             0x00000018
#define _ADEVCFG1_FWDTWINSZ_MASK                 0x03000000
#define _ADEVCFG1_FWDTWINSZ_LENGTH               0x00000002

#define _ADEVCFG1_DMTCNT_POSITION                0x0000001A
#define _ADEVCFG1_DMTCNT_MASK                    0x7C000000
#define _ADEVCFG1_DMTCNT_LENGTH                  0x00000005

#define _ADEVCFG1_FDMTEN_POSITION                0x0000001F
#define _ADEVCFG1_FDMTEN_MASK                    0x80000000
#define _ADEVCFG1_FDMTEN_LENGTH                  0x00000001

#define _ADEVCFG1_w_POSITION                     0x00000000
#define _ADEVCFG1_w_MASK                         0xFFFFFFFF
#define _ADEVCFG1_w_LENGTH                       0x00000020

#define _ADEVCFG0_DEBUG_POSITION                 0x00000000
#define _ADEVCFG0_DEBUG_MASK                     0x00000003
#define _ADEVCFG0_DEBUG_LENGTH                   0x00000002

#define _ADEVCFG0_JTAGEN_POSITION                0x00000002
#define _ADEVCFG0_JTAGEN_MASK                    0x00000004
#define _ADEVCFG0_JTAGEN_LENGTH                  0x00000001

#define _ADEVCFG0_ICESEL_POSITION                0x00000003
#define _ADEVCFG0_ICESEL_MASK                    0x00000018
#define _ADEVCFG0_ICESEL_LENGTH                  0x00000002

#define _ADEVCFG0_TRCEN_POSITION                 0x00000005
#define _ADEVCFG0_TRCEN_MASK                     0x00000020
#define _ADEVCFG0_TRCEN_LENGTH                   0x00000001

#define _ADEVCFG0_BOOTISA_POSITION               0x00000006
#define _ADEVCFG0_BOOTISA_MASK                   0x00000040
#define _ADEVCFG0_BOOTISA_LENGTH                 0x00000001

#define _ADEVCFG0_FECCCON_POSITION               0x00000008
#define _ADEVCFG0_FECCCON_MASK                   0x00000300
#define _ADEVCFG0_FECCCON_LENGTH                 0x00000002

#define _ADEVCFG0_FSLEEP_POSITION                0x0000000A
#define _ADEVCFG0_FSLEEP_MASK                    0x00000400
#define _ADEVCFG0_FSLEEP_LENGTH                  0x00000001

#define _ADEVCFG0_DBGPER_POSITION                0x0000000C
#define _ADEVCFG0_DBGPER_MASK                    0x00007000
#define _ADEVCFG0_DBGPER_LENGTH                  0x00000003

#define _ADEVCFG0_SMCLR_POSITION                 0x0000000F
#define _ADEVCFG0_SMCLR_MASK                     0x00008000
#define _ADEVCFG0_SMCLR_LENGTH                   0x00000001

#define _ADEVCFG0_SOSCGAIN_POSITION              0x00000010
#define _ADEVCFG0_SOSCGAIN_MASK                  0x00030000
#define _ADEVCFG0_SOSCGAIN_LENGTH                0x00000002

#define _ADEVCFG0_SOSCBOOST_POSITION             0x00000012
#define _ADEVCFG0_SOSCBOOST_MASK                 0x00040000
#define _ADEVCFG0_SOSCBOOST_LENGTH               0x00000001

#define _ADEVCFG0_POSCGAIN_POSITION              0x00000013
#define _ADEVCFG0_POSCGAIN_MASK                  0x00180000
#define _ADEVCFG0_POSCGAIN_LENGTH                0x00000002

#define _ADEVCFG0_POSCBOOST_POSITION             0x00000015
#define _ADEVCFG0_POSCBOOST_MASK                 0x00200000
#define _ADEVCFG0_POSCBOOST_LENGTH               0x00000001

#define _ADEVCFG0_POSCFGAIN_POSITION             0x00000016
#define _ADEVCFG0_POSCFGAIN_MASK                 0x00C00000
#define _ADEVCFG0_POSCFGAIN_LENGTH               0x00000002

#define _ADEVCFG0_POSCTYPE_POSITION              0x00000018
#define _ADEVCFG0_POSCTYPE_MASK                  0x03000000
#define _ADEVCFG0_POSCTYPE_LENGTH                0x00000002

#define _ADEVCFG0_POSCAGCRNG_POSITION            0x0000001A
#define _ADEVCFG0_POSCAGCRNG_MASK                0x04000000
#define _ADEVCFG0_POSCAGCRNG_LENGTH              0x00000001

#define _ADEVCFG0_POSCAGC_POSITION               0x0000001B
#define _ADEVCFG0_POSCAGC_MASK                   0x08000000
#define _ADEVCFG0_POSCAGC_LENGTH                 0x00000001

#define _ADEVCFG0_EJTAGBEN_POSITION              0x0000001E
#define _ADEVCFG0_EJTAGBEN_MASK                  0x40000000
#define _ADEVCFG0_EJTAGBEN_LENGTH                0x00000001

#define _ADEVCFG0_POSCAGCDLY_POSITION            0x00000018
#define _ADEVCFG0_POSCAGCDLY_MASK                0x03000000
#define _ADEVCFG0_POSCAGCDLY_LENGTH              0x00000002

#define _ADEVCFG0_FDEBUG_POSITION                0x00000000
#define _ADEVCFG0_FDEBUG_MASK                    0x00000003
#define _ADEVCFG0_FDEBUG_LENGTH                  0x00000002

#define _ADEVCFG0_w_POSITION                     0x00000000
#define _ADEVCFG0_w_MASK                         0xFFFFFFFF
#define _ADEVCFG0_w_LENGTH                       0x00000020

#define _ADEVCP0_CP_POSITION                     0x0000001C
#define _ADEVCP0_CP_MASK                         0x10000000
#define _ADEVCP0_CP_LENGTH                       0x00000001

#define _ADEVCP0_w_POSITION                      0x00000000
#define _ADEVCP0_w_MASK                          0xFFFFFFFF
#define _ADEVCP0_w_LENGTH                        0x00000020

#define _ASEQ3_TSEQ_POSITION                     0x00000000
#define _ASEQ3_TSEQ_MASK                         0x0000FFFF
#define _ASEQ3_TSEQ_LENGTH                       0x00000010

#define _ASEQ3_CSEQ_POSITION                     0x00000010
#define _ASEQ3_CSEQ_MASK                         0xFFFF0000
#define _ASEQ3_CSEQ_LENGTH                       0x00000010

#define _ASEQ3_w_POSITION                        0x00000000
#define _ASEQ3_w_MASK                            0xFFFFFFFF
#define _ASEQ3_w_LENGTH                          0x00000020

#define _AUBADEVCFG4_SWDTPS_POSITION             0x00000018
#define _AUBADEVCFG4_SWDTPS_MASK                 0x1F000000
#define _AUBADEVCFG4_SWDTPS_LENGTH               0x00000005

